In [11]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [12]:
import sqlite3
conn = sqlite3.connect('test.db')
print ("Opened database successfully");

Opened database successfully

In [13]:
import sqlite3
conn = sqlite3.connect('test.db')
print ("Opened database successfully");
conn.execute('''CREATE TABLE COMPANY
         (ID INT PRIMARY KEY     NOT NULL,
         NAME           TEXT    NOT NULL,
         AGE            INT     NOT NULL,
         ADDRESS        CHAR(50),
         SALARY         REAL);''')
print ("Table created successfully");
conn.close()

Opened database successfully
Table created successfully

In [14]:
# import sqlite3
# conn = sqlite3.connect('test.db')
# print ("Connection Success");
# conn.execute('''drop table company''')
# print ("Table dropped successfully");
# conn.close()

In [15]:
# conn.close()

In [16]:
import sqlite3
conn = sqlite3.connect('test.db')
print ("Opened database successfully");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (5, 'Devang', 21, 'California', 200000.00 )");
      
conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (6, 'Muktan', 21, 'Texas', 35000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (7, 'Vivek', 23, 'New Jersey', 50000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (8, 'Vishnu', 25, 'Rich-Mond', 65000.00 )");
conn.commit()
print ("Records created successfully");
conn.close()

Opened database successfully
Records created successfully

In [33]:
import sqlite3

conn = sqlite3.connect('test.db')
print ("Opened database successfully");

cursor = conn.execute("SELECT id, name, address, salary from COMPANY")
results =cursor.fetchall()
# print(results)
for col in results:
    # print(col,"\n")
    print ("ID = ", col[0])
    print ("NAME = ", col[1])
    print ("ADDRESS = ", col[2])
    print ("SALARY = ", col[3], "\n")
print ("Operation done successfully");
conn.close()

Opened database successfully
ID =  5
NAME =  Devang
ADDRESS =  California
SALARY =  200000.0

ID =  6
NAME =  Muktan
ADDRESS =  Texas
SALARY =  35000.0

ID =  7
NAME =  Vivek
ADDRESS =  New Jersey
SALARY =  50000.0

ID =  8
NAME =  Vishnu
ADDRESS =  Rich-Mond
SALARY =  65000.0

Operation done successfully

In [18]:
import sqlite3

conn = sqlite3.connect('test.db')
print ("Opened database successfully");

conn.execute("UPDATE COMPANY set SALARY = 25000.00 where ID = 1")
conn.commit()
print ("Total number of rows updated :", conn.total_changes)

cursor = conn.execute("SELECT id, name, address, salary from COMPANY")
for row in cursor:
   print ("ID = ", row[0])
   print ("NAME = ", row[1])
   print ("ADDRESS = ", row[2])
   print ("SALARY = ", row[3], "\n")

print ("Operation done successfully")
conn.close()

Opened database successfully
Total number of rows updated : 0
ID =  5
NAME =  Devang
ADDRESS =  California
SALARY =  200000.0

ID =  6
NAME =  Muktan
ADDRESS =  Texas
SALARY =  35000.0

ID =  7
NAME =  Vivek
ADDRESS =  New Jersey
SALARY =  50000.0

ID =  8
NAME =  Vishnu
ADDRESS =  Rich-Mond
SALARY =  65000.0

Operation done successfully

In [19]:
import sqlite3

conn = sqlite3.connect('test.db')
print ("Opened database successfully")

conn.execute("DELETE from COMPANY where ID = 2;")
conn.commit()
print ("Total number of rows deleted :", conn.total_changes)

cursor = conn.execute("SELECT id, name, address, salary from COMPANY")
for row in cursor:
   print ("ID = ", row[0])
   print ("NAME = ", row[1])
   print ("ADDRESS = ", row[2])
   print ("SALARY = ", row[3], "\n")

print ("Operation done successfully")
conn.close()

Opened database successfully
Total number of rows deleted : 0
ID =  5
NAME =  Devang
ADDRESS =  California
SALARY =  200000.0

ID =  6
NAME =  Muktan
ADDRESS =  Texas
SALARY =  35000.0

ID =  7
NAME =  Vivek
ADDRESS =  New Jersey
SALARY =  50000.0

ID =  8
NAME =  Vishnu
ADDRESS =  Rich-Mond
SALARY =  65000.0

Operation done successfully